TEACHERS_INFO = {
    "prof_abildaeva": {
        "bio": """👩‍🏫 Абилдаева Гүлнүр Балтабаевна
📚 Предмет: Web-программирование (Лекция)
📍 Кабинет: Главный корпус, 416""",
        "photo":"AgACAgIAAxkBAAIBRmqem8jiOSdmrj4mEv57CSWlRD96AAIEH2sb39T5SObGkvzfpXIUAQADAgADbQADPQQ"  
    },
    "prof_ashenbrener": {
        "bio": """👨‍🏫 Жәнібек Маржан Азатқызы
📚 Предмет: Структуры данных и алгоритмы их обработки (Лабораторные)
📍 Кабинет: Главный корпус, 300е""",
        "photo": "AgACAgIAAxkBAAIBWWqeqT3Y2JYoa1YiLGxWWhhSwjx3AAJ4H2sb39T5SPl9xvI-L_2AAQADAgADeAADPQQ"
    },
    "prof_kisina": {
        "bio": """👩‍🏫 Кисина Мира Каиржановна
📚 Предмет: Web-программирование (Лабораторные)
📍 Кабинет: Главный корпус, 300з""",
        "photo":"AgACAgIAAxkBAAIBSWqep5FRNmK1JhVeeY3_YyYokocaAAJlH2sb39T5SG3Kc2u-8D6yAQADAgADbQADPQQ"
    },
    "prof_makashev": {
        "bio": """👨‍🏫 Макашев Байжума Катираевич
📚 Предмет: Охрана труда (Лекция)
📍 Кабинет: Корпус №2, 311 / 511""",
        "photo":"AgACAgIAAxkBAAIBS2qep7VUXN5vjpAemPyP4ZwYSq65AAJmH2sb39T5SKpLREJlaLWeAQADAgADbQADPQQ"
    },
    "prof_musaeva": {
        "bio": """👩‍🏫 Мусаева Жайдары Толеубаевна
📚 Предмет: Основы права / Антикоррупционная культура
📍 Кабинет: Главный корпус, 352 / Корпус №1, 226""",
        "photo":"AgACAgIAAxkBAAIBTWqeqAc5nS2UBas9FrbdAfxvMlF1AAJoH2sb39T5SPkCduIaUNVJAQADAgADeAADPQQ"
    },
    "prof_nurtay": {
        "bio": """👨‍🏫 Нұртай Марғұлан Дәуітұлы
📚 Предмет: Объектно-ориентированное программирование (Лабораторные)
📍 Кабинет: Главный корпус, 300е""",
        "photo":"AgACAgIAAxkBAAIBT2qeqCn7Wps_MvZHsXp2DlaYRU_DAAJpH2sb39T5SA1qYIPDa0ZdAQADAgADbQADPQQ"
    },
    "prof_omarov": {
        "bio": """👨‍🏫 Сүлеймен Айнұр Елубайқызы
📚 Предмет: Верификация, стандартизация и сертификация ПО (Лабораторные)
📍 Кабинет: Главный корпус, 300з""",
        "photo":"AgACAgIAAxkBAAIBUWqeqHKvo4tB48g_lYtNBQABlHezSgACbR9rG9_U-UjUtCFWX_8PywEAAwIAA20AAz0E"
    },
    "prof_rakhatov": {
        "bio": """👨‍🏫 Рахатов Тілеуғабыл Дүйсенбекұлы
📚 Предмет: Охрана труда (Лабораторные)
📍 Кабинет: Корпус №2, 517""",
        "photo": "AgACAgIAAxkBAAIBU2qeqLRK4KNeMzGNQQtSGGisU6ZpAAJvH2sb39T5SD6u_MkJ88raAQADAgADbQADPQQ"
    },
    "prof_saimanova": {
        "bio": """👩‍🏫 Сайманова Загира Бекетаевна
📚 Предмет: Верификация, стандартизация и сертификация ПО (Лекция)
📍 Кабинет: Главный корпус, 404""",
        "photo": "AgACAgIAAxkBAAIBVWqeqMo8OSDSd_pflLJfbpa5AAFYKQACcB9rG9_U-UiWd4p-LHmLTgEAAwIAA20AAz0E"
    },
    "prof_smagulova": {
        "bio": """👩‍🏫 Смагулова Асемгуль Сериковна
📚 Предмет: Структуры данных и алгоритмы их обработки (Лекция)
📍 Кабинет: Главный корпус, 405""",
        "photo":"AgACAgIAAxkBAAIBV2qeqOQLgFd0DejrUQABfjbiumY55gACcR9rG9_U-UhYnUbjkRBu8QEAAwIAA20AAz0E"
    },
    "prof_tau": {
        "bio": """👨‍🏫 Тау А.Ғ.
📚 Предмет: Объектно-ориентированное программирование (Лекция)
📍 Кабинет: Главный корпус, 404""",
        "photo": "AgACAgIAAxkBAAIBWWqeqT3Y2JYoa1YiLGxWWhhSwjx3AAJ4H2sb39T5SPl9xvI-L_2AAQADAgADeAADPQQ"
    }
}


info_buttons = {
    "about_info": "Я простой бот для расписания",
    "creator_info": "Мой создатель em9"
}


SCHEDULE = {
    "числитель": {
        "понедельник": """📅 ПОНЕДЕЛЬНИК (Числитель)

🔹 2 пара (10:55 - 12:40)
📚 Объектно-ориентированное программирование (Лекция)
👨‍🏫 Тау А.Ф.
📍 Главный корпус, 404

🔹 3 пара (13:10 - 14:55)
📚 Структуры данных и алгоритмы их обработки (Лаб)
👨‍🏫 Жәнібек Маржан Азатқызы
📍 Главный корпус, 300е""",

        "вторник": """📅 ВТОРНИК (Числитель)

🔹 2 пара (10:55 - 12:40)
📚 Web-программирование (Лаб)
👩‍🏫 Кисина М.К.
📍 Главный корпус, 300з

🔹 3 пара (13:10 - 14:55)
📚 Структуры данных и алгоритмы их обработки (Лекция)
👩‍🏫 Смагулова А.С.
📍 Главный корпус, 405""",

        "среда": """📅 СРЕДА (Числитель)

🔹 1 пара (09:00 - 10:45)
📚 Основы права, Основы антикоррупционной культуры (Лекция)
👩‍🏫 Мусаева Ж.Т.
📍 Главный корпус, 352

🔹 2 пара (10:55 - 12:40)
📚 Охрана труда (Лекция)
👨‍🏫 Макашев Б.К.
📍 Корпус №2, 311""",

        "четверг": """📅 ЧЕТВЕРГ (Числитель)

🔹 1 пара (09:00 - 10:45)
📚 Объектно-ориентированное программирование (Лаб)
👨‍🏫 Нұртай М.Д.
📍 Главный корпус, 300е

🔹 2 пара (10:55 - 12:40)
📚 Верификация, стандартизация и сертификация ПО (Лаб)
👨‍🏫 Сүлеймен Айнұр Елубайқызы
📍 Главный корпус, 300з

🔹 3 пара (13:10 - 14:55)
📚 Охрана труда (Лаб)
👨‍🏫 Рахатов Т.Д.
📍 Корпус №2, 517""",

        "пятница": """📅 ПЯТНИЦА\n\n🎉 Пар нет / Выходной""",
        "суббота": """📅 СУББОТА\n\n🎉 Пар нет / Выходной""",
        "воскресенье": """📅 ВОСКРЕСЕНЬЕ\n\n🎉 Пар нет / Выходной""",
    },

    "знаменатель": {
        "понедельник": """📅 ПОНЕДЕЛЬНИК (Знаменатель)

🔹 1 пара (09:00 - 10:45)
📚 Web-программирование (Лекция)
👩‍🏫 Абилдаева Г.Б.
📍 Главный корпус, 416

🔹 2 пара (10:55 - 12:40)
📚 Структуры данных и алгоритмы их обработки (Лаб)
👨‍🏫 Жәнібек Маржан Азатқызы
📍 Главный корпус, 300е""",

        "вторник": """📅 ВТОРНИК (Знаменатель)

🔹 2 пара (10:55 - 12:40)
📚 Web-программирование (Лаб)
👩‍🏫 Кисина М.К.
📍 Главный корпус, 300з

🔹 3 пара (13:10 - 14:55)
📚 Верификация, стандартизация и сертификация ПО (Лекция)
👩‍🏫 Сайманова З.Б.
📍 Главный корпус, 404""",

        "среда": """📅 СРЕДА (Знаменатель)

🔹 1 пара (09:00 - 10:45)
📚 Основы права, Основы антикоррупционной культуры (Лекция)
👩‍🏫 Мусаева Ж.Т.
📍 Главный корпус, 352

🔹 2 пара (10:55 - 12:40)
📚 Охрана труда (Лекция)
👨‍🏫 Макашев Б.К.
📍 Корпус №2, 511""",

        "четверг": """📅 ЧЕТВЕРГ (Знаменатель)

🔹 1 пара (09:00 - 10:45)
📚 Объектно-ориентированное программирование (Лаб)
👨‍🏫 Нұртай М.Д.
📍 Главный корпус, 300е

🔹 2 пара (10:55 - 12:40)
📚 Верификация, стандартизация и сертификация ПО (Лаб)
👨‍🏫 Сүлеймен Айнұр Елубайқызы
📍 Главный корпус, 300з

🔹 3 пара (13:10 - 14:55)
📚 Основы права, Основы антикоррупционной культуры (СПЗ)
👩‍🏫 Мусаева Ж.Т.
📍 Корпус №1, 226""",

        "пятница": """📅 ПЯТНИЦА\n\n🎉 Пар нет / Выходной""",
        "суббота": """📅 СУББОТА\n\n🎉 Пар нет / Выходной""",
        "воскресенье": """📅 ВОСКРЕСЕНЬЕ\n\n🎉 Пар нет / Выходной""",
    }
}