TEACHERS_INFO = {
    "prof_tau": """👨‍🏫 Тау А.Ф.
📚 Объектно-ориентированное программирование (Лекция)
📍 Главный корпус, 404""",

    "prof_kisina": """👩‍🏫 Кисина М.К.
📚 Web-программирование (Лаб)
📍 Главный корпус, 300з""",

    "prof_ashenbrener": """👨‍🏫 Ашенбренер Ю.В.
📚 Структуры данных и алгоритмы их обработки (Лаб)
📍 Главный корпус, 300е""",

    "prof_smagulova": """👩‍🏫 Смагулова А.С.
📚 Структуры данных и алгоритмы их обработки (Лекция)
📍 Главный корпус, 405""",

    "prof_musaeva": """👩‍🏫 Мусаева Ж.Т.
📚 Основы права, Основы антикоррупционной культуры (Лекция)
📍 Главный корпус, 352""",

    "prof_makashev": """👨‍🏫 Макашев Б.К.
📚 Охрана труда (Лекция)
📍 Корпус №2, 311""",

    "prof_nurtay": """👨‍🏫 Нұртай М.Д.
📚 Объектно-ориентированное программирование (Лаб)
📍 Главный корпус, 300е""",

    "prof_omarov": """👨‍🏫 Омаров Ш.Ә.
📚 Верификация, стандартизация и сертификация ПО (Лаб)
📍 Главный корпус, 300з""",

    "prof_rakhatov": """👨‍🏫 Рахатов Т.Д.
📚 Охрана труда (Лаб)
📍 Корпус №2, 517""",
}


info_buttons = {
    "about_info": "Я простой бот для расписания",
    "creator_info": "Мой создатель em9"
}


SCHEDULE = {
    "числитель": {
        "понедельник": """📅 ПОНЕДЕЛЬНИК (Числитель)

🔹 2 пара (10:55 - 12:40)
📚 Объектно-ориентированное программирование (Лекция)
👨‍🏫 Тау А.Ф.
📍 Главный корпус, 404

🔹 3 пара (13:10 - 14:55)
📚 Структуры данных и алгоритмы их обработки (Лаб)
👨‍🏫 Ашенбренер Ю.В.
📍 Главный корпус, 300е""",

        "вторник": """📅 ВТОРНИК (Числитель)

🔹 2 пара (10:55 - 12:40)
📚 Web-программирование (Лаб)
👩‍🏫 Кисина М.К.
📍 Главный корпус, 300з

🔹 3 пара (13:10 - 14:55)
📚 Структуры данных и алгоритмы их обработки (Лекция)
👩‍🏫 Смагулова А.С.
📍 Главный корпус, 405""",

        "среда": """📅 СРЕДА (Числитель)

🔹 1 пара (09:00 - 10:45)
📚 Основы права, Основы антикоррупционной культуры (Лекция)
👩‍🏫 Мусаева Ж.Т.
📍 Главный корпус, 352

🔹 2 пара (10:55 - 12:40)
📚 Охрана труда (Лекция)
👨‍🏫 Макашев Б.К.
📍 Корпус №2, 311""",

        "четверг": """📅 ЧЕТВЕРГ (Числитель)

🔹 1 пара (09:00 - 10:45)
📚 Объектно-ориентированное программирование (Лаб)
👨‍🏫 Нұртай М.Д.
📍 Главный корпус, 300е

🔹 2 пара (10:55 - 12:40)
📚 Верификация, стандартизация и сертификация ПО (Лаб)
👨‍🏫 Омаров Ш.Ә.
📍 Главный корпус, 300з

🔹 3 пара (13:10 - 14:55)
📚 Охрана труда (Лаб)
👨‍🏫 Рахатов Т.Д.
📍 Корпус №2, 517""",

        "пятница": """📅 ПЯТНИЦА\n\n🎉 Пар нет / Выходной""",
        "суббота": """📅 СУББОТА\n\n🎉 Пар нет / Выходной""",
        "воскресенье": """📅 ВОСКРЕСЕНЬЕ\n\n🎉 Пар нет / Выходной""",
    },

    "знаменатель": {
        "понедельник": """📅 ПОНЕДЕЛЬНИК (Знаменатель)

🔹 1 пара (09:00 - 10:45)
📚 Web-программирование (Лекция)
👩‍🏫 Абилдаева Г.Б.
📍 Главный корпус, 416

🔹 2 пара (10:55 - 12:40)
📚 Структуры данных и алгоритмы их обработки (Лаб)
👨‍🏫 Ашенбренер Ю.В.
📍 Главный корпус, 300е""",

        "вторник": """📅 ВТОРНИК (Знаменатель)

🔹 2 пара (10:55 - 12:40)
📚 Web-программирование (Лаб)
👩‍🏫 Кисина М.К.
📍 Главный корпус, 300з

🔹 3 пара (13:10 - 14:55)
📚 Верификация, стандартизация и сертификация ПО (Лекция)
👩‍🏫 Сайманова З.Б.
📍 Главный корпус, 404""",

        "среда": """📅 СРЕДА (Знаменатель)

🔹 1 пара (09:00 - 10:45)
📚 Основы права, Основы антикоррупционной культуры (Лекция)
👩‍🏫 Мусаева Ж.Т.
📍 Главный корпус, 352

🔹 2 пара (10:55 - 12:40)
📚 Охрана труда (Лекция)
👨‍🏫 Макашев Б.К.
📍 Корпус №2, 511""",

        "четверг": """📅 ЧЕТВЕРГ (Знаменатель)

🔹 1 пара (09:00 - 10:45)
📚 Объектно-ориентированное программирование (Лаб)
👨‍🏫 Нұртай М.Д.
📍 Главный корпус, 300е

🔹 2 пара (10:55 - 12:40)
📚 Верификация, стандартизация и сертификация ПО (Лаб)
👨‍🏫 Омаров Ш.Ә.
📍 Главный корпус, 300з

🔹 3 пара (13:10 - 14:55)
📚 Основы права, Основы антикоррупционной культуры (СПЗ)
👩‍🏫 Мусаева Ж.Т.
📍 Корпус №1, 226""",

        "пятница": """📅 ПЯТНИЦА\n\n🎉 Пар нет / Выходной""",
        "суббота": """📅 СУББОТА\n\n🎉 Пар нет / Выходной""",
        "воскресенье": """📅 ВОСКРЕСЕНЬЕ\n\n🎉 Пар нет / Выходной""",
    }
}